nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
                  <description>mclk frequency = 1/164 * hmclk frequency</description>
                  <value>0xA3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_165</name>
                  <description>mclk frequency = 1/165 * hmclk frequency</description>
                  <value>0xA4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_166</name>
                  <description>mclk frequency = 1/166 * hmclk frequency</description>
                  <value>0xA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_167</name>
                  <description>mclk frequency = 1/167 * hmclk frequency</description>
                  <value>0xA6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_168</name>
                  <description>mclk frequency = 1/168 * hmclk frequency</description>
                  <value>0xA7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_169</name>
                  <description>mclk frequency = 1/169 * hmclk frequency</description>
                  <value>0xA8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_170</name>
                  <description>mclk frequency = 1/170 * hmclk frequency</description>
                  <value>0xA9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_171</name>
                  <description>mclk frequency = 1/171 * hmclk frequency</description>
                  <value>0xAA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_172</name>
                  <description>mclk frequency = 1/172 * hmclk frequency</description>
                  <value>0xAB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_173</name>
                  <description>mclk frequency = 1/173 * hmclk frequency</description>
                  <value>0xAC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_174</name>
                  <description>mclk frequency = 1/174 * hmclk frequency</description>
                  <value>0xAD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_175</name>
                  <description>mclk frequency = 1/175 * hmclk frequency</description>
                  <value>0xAE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_176</name>
                  <description>mclk frequency = 1/176 * hmclk frequency</description>
                  <value>0xAF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_177</name>
                  <description>mclk frequency = 1/177 * hmclk frequency</description>
                  <value>0xB0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_178</name>
                  <description>mclk frequency = 1/178 * hmclk frequency</description>
                  <value>0xB1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_179</name>
                  <description>mclk frequency = 1/179 * hmclk frequency</description>
                  <value>0xB2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_180</name>
                  <description>mclk frequency = 1/180 * hmclk frequency</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_181</name>
                  <description>mclk frequency = 1/181 * hmclk frequency</description>
                  <value>0xB4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_182</name>
                  <description>mclk frequency = 1/182 * hmclk frequency</description>
                  <value>0xB5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_183</name>
                  <description>mclk frequency = 1/183 * hmclk frequency</description>
                  <value>0xB6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_184</name>
                  <description>mclk frequency = 1/184 * hmclk frequency</description>
                  <value>0xB7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_185</name>
                  <description>mclk frequency = 1/185 * hmclk frequency</description>
                  <value>0xB8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_186</name>
                  <description>mclk frequency = 1/186 * hmclk frequency</description>
                  <value>0xB9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_187</name>
                  <description>mclk frequency = 1/187 * hmclk frequency</description>
                  <value>0xBA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_188</name>
                  <description>mclk frequency = 1/188 * hmclk frequency</description>
                  <value>0xBB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_189</name>
                  <description>mclk frequency = 1/189 * hmclk frequency</description>
                  <value>0xBC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_190</name>
                  <description>mclk frequency = 1/190 * hmclk frequency</description>
                  <value>0xBD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_191</name>
                  <description>mclk frequency = 1/191 * hmclk frequency</description>
                  <value>0xBE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_192</name>
                  <description>mclk frequency = 1/192 * hmclk frequency</description>
                  <value>0xBF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_193</name>
                  <description>mclk frequency = 1/193 * hmclk frequency</description>
                  <value>0xC0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_194</name>
                  <description>mclk frequency = 1/194 * hmclk frequency</description>
                  <value>0xC1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_195</name>
                  <description>mclk frequency = 1/195 * hmclk frequency</description>
                  <value>0xC2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_196</name>
                  <description>mclk frequency = 1/196 * hmclk frequency</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_197</name>
                  <description>mclk frequency = 1/197 * hmclk frequency</description>
                  <value>0xC4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_198</name>
                  <description>mclk frequency = 1/198 * hmclk frequency</description>
                  <value>0xC5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_199</name>
                  <description>mclk frequency = 1/199 * hmclk frequency</description>
                  <value>0xC6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_200</name>
                  <description>mclk frequency = 1/200 * hmclk frequency</description>
                  <value>0xC7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_201</name>
                  <description>mclk frequency = 1/201 * hmclk frequency</description>
                  <value>0xC8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_202</name>
                  <description>mclk frequency = 1/202 * hmclk frequency</description>
                  <value>0xC9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_203</name>
                  <description>mclk frequency = 1/203 * hmclk frequency</description>
                  <value>0xCA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_204</name>
                  <description>mclk frequency = 1/204 * hmclk frequency</description>
                  <value>0xCB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_205</name>
                  <description>mclk frequency = 1/205 * hmclk frequency</description>
                  <value>0xCC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_206</name>
                  <description>mclk frequency = 1/206 * hmclk frequency</description>
                  <value>0xCD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_207</name>
                  <description>mclk frequency = 1/207 * hmclk frequency</description>
                  <value>0xCE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_208</name>
                  <description>mclk frequency = 1/208 * hmclk frequency</description>
                  <value>0xCF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_209</name>
                  <description>mclk frequency = 1/209 * hmclk frequency</description>
                  <value>0xD0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_210</name>
                  <description>mclk frequency = 1/210 * hmclk frequency</description>
                  <value>0xD1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_211</name>
                  <description>mclk frequency = 1/211 * hmclk frequency</description>
                  <value>0xD2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_212</name>
                  <description>mclk frequency = 1/212 * hmclk frequency</description>
                  <value>0xD3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_213</name>
                  <description>mclk frequency = 1/213 * hmclk frequency</description>
                  <value>0xD4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_214</name>
                  <description>mclk frequency = 1/214 * hmclk frequency</description>
                  <value>0xD5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_215</name>
                  <description>mclk frequency = 1/215 * hmclk frequency</description>
                  <value>0xD6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_216</name>
                  <description>mclk frequency = 1/216 * hmclk frequency</description>
                  <value>0xD7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_217</name>
                  <description>mclk frequency = 1/217 * hmclk frequency</description>
                  <value>0xD8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_218</name>
                  <description>mclk frequency = 1/218 * hmclk frequency</description>
                  <value>0xD9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_219</name>
                  <description>mclk frequency = 1/219 * hmclk frequency</description>
                  <value>0xDA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_220</name>
                  <description>mclk frequency = 1/220 * hmclk frequency</description>
                  <value>0xDB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_221</name>
                  <description>mclk frequency = 1/221 * hmclk frequency</description>
                  <value>0xDC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_222</name>
                  <description>mclk frequency = 1/222 * hmclk frequency</description>
                  <value>0xDD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_223</name>
                  <description>mclk frequency = 1/223 * hmclk frequency</description>
                  <value>0xDE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_224</name>
                  <description>mclk frequency = 1/224 * hmclk frequency</description>
                  <value>0xDF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_225</name>
                  <description>mclk frequency = 1/225 * hmclk frequency</description>
                  <value>0xE0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_226</name>
                  <description>mclk frequency = 1/226 * hmclk frequency</description>
                  <value>0xE1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_227</name>
                  <description>mclk frequency = 1/227 * hmclk frequency</description>
                  <value>0xE2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_228</name>
                  <description>mclk frequency = 1/228 * hmclk frequency</description>
                  <value>0xE3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_229</name>
                  <description>mclk frequency = 1/229 * hmclk frequency</description>
                  <value>0xE4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_230</name>
                  <description>mclk frequency = 1/230 * hmclk frequency</description>
                  <value>0xE5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_231</name>
                  <description>mclk frequency = 1/231 * hmclk frequency</description>
                  <value>0xE6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_232</name>
                  <description>mclk frequency = 1/232 * hmclk frequency</description>
                  <value>0xE7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_233</name>
                  <description>mclk frequency = 1/233 * hmclk frequency</description>
                  <value>0xE8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_234</name>
                  <description>mclk frequency = 1/234 * hmclk frequency</description>
                  <value>0xE9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_235</name>
                  <description>mclk frequency = 1/235 * hmclk frequency</description>
                  <value>0xEA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_236</name>
                  <description>mclk frequency = 1/236 * hmclk frequency</description>
                  <value>0xEB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_237</name>
                  <description>mclk frequency = 1/237 * hmclk frequency</description>
                  <value>0xEC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_238</name>
                  <description>mclk frequency = 1/238 * hmclk frequency</description>
                  <value>0xED</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_239</name>
                  <description>mclk frequency = 1/239 * hmclk frequency</description>
                  <value>0xEE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_240</name>
                  <description>mclk frequency = 1/240 * hmclk frequency</description>
                  <value>0xEF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_241</name>
                  <description>mclk frequency = 1/241 * hmclk frequency</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_242</name>
                  <description>mclk frequency = 1/242 * hmclk frequency</description>
                  <value>0xF1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_243</name>
                  <description>mclk frequency = 1/243 * hmclk frequency</description>
                  <value>0xF2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_244</name>
                  <description>mclk frequency = 1/244 * hmclk frequency</description>
                  <value>0xF3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_245</name>
                  <description>mclk frequency = 1/245 * hmclk frequency</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_246</name>
                  <description>mclk frequency = 1/246 * hmclk frequency</description>
                  <value>0xF5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_247</name>
                  <description>mclk frequency = 1/247 * hmclk frequency</description>
                  <value>0xF6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_248</name>
                  <description>mclk frequency = 1/248 * hmclk frequency</description>
                  <value>0xF7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_249</name>
                  <description>mclk frequency = 1/249 * hmclk frequency</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_250</name>
                  <description>mclk frequency = 1/250 * hmclk frequency</description>
                  <value>0xF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_251</name>
                  <description>mclk frequency = 1/251 * hmclk frequency</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_252</name>
                  <description>mclk frequency = 1/252 * hmclk frequency</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_253</name>
                  <description>mclk frequency = 1/253 * hmclk frequency</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_254</name>
                  <description>mclk frequency = 1/254 * hmclk frequency</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_255</name>
                  <description>mclk frequency = 1/255 * hmclk frequency</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_256</name>
                  <description>mclk frequency = 1/256 * hmclk frequency</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_SW_RST</name>
              <description>MQS software reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_SW_RST_0</name>
                  <description>Exit software reset for MQS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_SW_RST_1</name>
                  <description>Enable software reset for MQS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_EN</name>
              <description>MQS enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_EN_0</name>
                  <description>Disable MQS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_EN_1</name>
                  <description>Enable MQS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_OVERSAMPLE</name>
              <description>Used to control the PWM oversampling rate compared with mclk.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MQS_OVERSAMPLE_0</name>
                  <description>32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MQS_OVERSAMPLE_1</name>
                  <description>64</description>
