nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TMR_CNTS_FREEZE</name>
              <description>QTIMER1 timer counter freeze</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TMR_CNTS_FREEZE</name>
              <description>QTIMER2 timer counter freeze</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TMR_CNTS_FREEZE</name>
              <description>QTIMER3 timer counter freeze</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TMR_CNTS_FREEZE</name>
              <description>QTIMER4 timer counter freeze</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TMR_CNTS_FREEZE_0</name>
                  <description>timer counter work normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TMR_CNTS_FREEZE_1</name>
                  <description>reset counter and ouput flags</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR3</name>
          <description>GPR3 General Purpose Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCRAM_CTL</name>
              <description>OCRAM_CTL[3] - write address pipeline control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCP_KEY_SEL</name>
              <description>Select 128-bit dcp key from 256-bit key from SNVS Master Key</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCP_KEY_SEL_0</name>
                  <description>Select [127:0] from SNVS Master Key as dcp key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCP_KEY_SEL_1</name>
                  <description>Select [255:128] from SNVS Master Key as dcp key</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM2_CTL</name>
              <description>OCRAM2_CTL[3] - write address pipeline control bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXBS_L_HALT_REQ</name>
              <description>Request to halt axbs_l</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_HALT_REQ_0</name>
                  <description>axbs_l normal run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_HALT_REQ_1</name>
                  <description>request to halt axbs_l</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_STATUS</name>
              <description>This field shows the OCRAM pipeline settings status, controlled by OCRAM_CTL bits respectively</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCRAM2_STATUS</name>
              <description>This field shows the OCRAM2 pipeline settings status, controlled by OCRAM2_CTL bits respectively</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXBS_L_HALTED</name>
              <description>This bit shows the status of axbs_l</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_L_HALTED_0</name>
                  <description>axbs_l is not halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_L_HALTED_1</name>
                  <description>axbs_l is in halted status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
