nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_17_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_18</name>
              <description>IOMUXC XBAR_INOUT18 function direction select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_18_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_18_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_19</name>
              <description>IOMUXC XBAR_INOUT19 function direction select</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_19_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_19_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR7</name>
          <description>GPR7 General Purpose Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI2C1_STOP_REQ</name>
              <description>LPI2C1 stop request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C2_STOP_REQ</name>
              <description>LPI2C2 stop request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C2_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C2_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C3_STOP_REQ</name>
              <description>LPI2C3 stop request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C3_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C3_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C4_STOP_REQ</name>
              <description>LPI2C4 stop request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C4_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C4_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_STOP_REQ</name>
              <description>LPSPI1 stop request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_STOP_REQ</name>
              <description>LPSPI2 stop request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI3_STOP_REQ</name>
              <description>LPSPI3 stop request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI3_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI3_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI4_STOP_REQ</name>
              <description>LPSPI4 stop request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI4_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI4_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1_STOP_REQ</name>
              <description>LPUART1 stop request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART1_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART2_STOP_REQ</name>
              <description>LPUART1 stop request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART2_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART3_STOP_REQ</name>
              <description>LPUART3 stop request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART3_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART3_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART4_STOP_REQ</name>
              <description>LPUART4 stop request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART4_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART4_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART5_STOP_REQ</name>
              <description>LPUART5 stop request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART5_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART5_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART6_STOP_REQ</name>
              <description>LPUART6 stop request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART6_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART6_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART7_STOP_REQ</name>
              <description>LPUART7 stop request</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART7_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART7_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART8_STOP_REQ</name>
              <description>LPUART8 stop request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART8_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART8_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C1_STOP_ACK</name>
              <description>LPI2C1 stop acknowledge</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted (the module is in Stop mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C2_STOP_ACK</name>
              <description>LPI2C2 stop acknowledge</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C2_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C2_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C3_STOP_ACK</name>
              <description>LPI2C3 stop acknowledge</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C3_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C3_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C4_STOP_ACK</name>
              <description>LPI2C4 stop acknowledge</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C4_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C4_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_STOP_ACK</name>
              <description>LPSPI1 stop acknowledge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_STOP_ACK</name>
              <description>LPSPI2 stop acknowledge</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI3_STOP_ACK</name>
              <description>LPSPI3 stop acknowledge</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI3_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI3_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI4_STOP_ACK</name>
              <description>LPSPI4 stop acknowledge</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI4_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI4_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1_STOP_ACK</name>
              <description>LPUART1 stop acknowledge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART1_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART2_STOP_ACK</name>
              <description>LPUART1 stop acknowledge</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART2_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART3_STOP_ACK</name>
              <description>LPUART3 stop acknowledge</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART3_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART3_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART4_STOP_ACK</name>
              <description>LPUART4 stop acknowledge</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART4_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART4_STOP_ACK_1</name>
