nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART5_STOP_ACK</name>
              <description>LPUART5 stop acknowledge</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART5_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART5_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART6_STOP_ACK</name>
              <description>LPUART6 stop acknowledge</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART6_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART6_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART7_STOP_ACK</name>
              <description>LPUART7 stop acknowledge</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART7_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART7_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART8_STOP_ACK</name>
              <description>LPUART8 stop acknowledge</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART8_STOP_ACK_0</name>
                  <description>stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART8_STOP_ACK_1</name>
                  <description>stop acknowledge is asserted (the module is in Stop mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR8</name>
          <description>GPR8 General Purpose Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI2C1_IPG_STOP_MODE</name>
              <description>LPI2C1 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C1_IPG_DOZE</name>
              <description>LPI2C1 ipg_doze mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C2_IPG_STOP_MODE</name>
              <description>LPI2C2 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C2_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C2_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C2_IPG_DOZE</name>
              <description>LPI2C2 ipg_doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C2_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C2_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C3_IPG_STOP_MODE</name>
              <description>LPI2C3 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C3_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C3_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C3_IPG_DOZE</name>
              <description>LPI2C3 ipg_doze mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C3_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C3_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C4_IPG_STOP_MODE</name>
              <description>LPI2C4 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C4_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C4_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C4_IPG_DOZE</name>
              <description>LPI2C4 ipg_doze mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C4_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C4_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_IPG_STOP_MODE</name>
              <description>LPSPI1 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_IPG_DOZE</name>
              <description>LPSPI1 ipg_doze mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_IPG_STOP_MODE</name>
              <description>LPSPI2 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_IPG_DOZE</name>
              <description>LPSPI2 ipg_doze mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI3_IPG_STOP_MODE</name>
              <description>LPSPI3 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI3_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI3_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI3_IPG_DOZE</name>
              <description>LPSPI3 ipg_doze mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI3_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI3_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI4_IPG_STOP_MODE</name>
              <description>LPSPI4 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI4_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI4_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI4_IPG_DOZE</name>
              <description>LPSPI4 ipg_doze mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI4_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI4_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1_IPG_STOP_MODE</name>
              <description>LPUART1 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART1_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1_IPG_DOZE</name>
              <description>LPUART1 ipg_doze mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART1_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART2_IPG_STOP_MODE</name>
              <description>LPUART2 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART2_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART2_IPG_DOZE</name>
              <description>LPUART2 ipg_doze mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART2_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART3_IPG_STOP_MODE</name>
              <description>LPUART3 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART3_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART3_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART3_IPG_DOZE</name>
              <description>LPUART3 ipg_doze mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART3_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART3_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART4_IPG_STOP_MODE</name>
              <description>LPUART4 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART4_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART4_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART4_IPG_DOZE</name>
              <description>LPUART4 ipg_doze mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART4_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART4_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
