nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>WDOG1</name>
      <description>WDOG</description>
      <groupName>WDOG</groupName>
      <headerStructName>WDOG</headerStructName>
      <baseAddress>0x400B8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xA</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDOG1</name>
        <value>92</value>
      </interrupt>
      <registers>
        <register>
          <name>WCR</name>
          <description>Watchdog Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x30</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WDZST</name>
              <description>WDZST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDZST_0</name>
                  <description>Continue timer operation (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDZST_1</name>
                  <description>Suspend the watchdog timer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDBG</name>
              <description>WDBG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDBG_0</name>
                  <description>Continue WDOG timer operation (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDBG_1</name>
                  <description>Suspend the watchdog timer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>WDE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDE_0</name>
                  <description>Disable the Watchdog (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDE_1</name>
                  <description>Enable the Watchdog.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDT_0</name>
                  <description>No effect on WDOG_B (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_1</name>
                  <description>Assert WDOG_B upon a Watchdog Time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRS</name>
              <description>SRS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRS_0</name>
                  <description>Assert system reset signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRS_1</name>
                  <description>No effect on the system (Default).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDA</name>
              <description>WDA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDA_0</name>
                  <description>Assert WDOG_B output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDA_1</name>
                  <description>No effect on system (Default).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRE</name>
              <description>Software Reset Extension, an optional way to generate software reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRE_0</name>
                  <description>using original way to generate software reset (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRE_1</name>
                  <description>using new way to generate software reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDW</name>
              <description>WDW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDW_0</name>
                  <description>Continue WDOG timer operation (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDW_1</name>
                  <description>Suspend WDOG timer operation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WT</name>
              <description>WT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WT_0</name>
                  <description>- 0.5 Seconds (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WT_1</name>
                  <description>- 1.0 Seconds.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WT_2</name>
                  <description>- 1.5 Seconds.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WT_3</name>
                  <description>- 2.0 Seconds.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WT_255</name>
                  <description>- 128 Seconds.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WSR</name>
          <description>Watchdog Service Register</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WSR</name>
              <description>WSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WSR_21845</name>
                  <description>Write to the Watchdog Service Register (WDOG_WSR).</description>
                  <value>0x5555</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WSR_43690</name>
                  <description>Write to the Watchdog Service Register (WDOG_WSR).</description>
                  <value>0xAAAA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRSR</name>
          <description>Watchdog Reset Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SFTW</name>
              <description>SFTW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFTW_0</name>
                  <description>Reset is not the result of a software reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFTW_1</name>
                  <description>Reset is the result of a software reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOUT</name>
              <description>TOUT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOUT_0</name>
                  <description>Reset is not the result of a WDOG timeout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT_1</name>
                  <description>Reset is the result of a WDOG timeout.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR</name>
              <description>POR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_0</name>
                  <description>Reset is not the result of a power on reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_1</name>
                  <description>Reset is the result of a power on reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WICR</name>
          <description>Watchdog Interrupt Control Register</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WICT</name>
              <description>WICT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WICT_0</name>
                  <description>WICT[7:0] = Time duration between interrupt and time-out is 0 seconds.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WICT_1</name>
                  <description>WICT[7:0] = Time duration between interrupt and time-out is 0.5 seconds.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WICT_4</name>
                  <description>WICT[7:0] = Time duration between interrupt and time-out is 2 seconds (Default).</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WICT_255</name>
                  <description>WICT[7:0] = Time duration between interrupt and time-out is 127.5 seconds.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTIS</name>
              <description>WTIS</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WTIS_0</name>
                  <description>No interrupt has occurred (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WTIS_1</name>
                  <description>Interrupt has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIE</name>
              <description>WIE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIE_0</name>
                  <description>Disable Interrupt (Default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIE_1</name>
                  <description>Enable Interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WMCR</name>
          <description>Watchdog Miscellaneous Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PDE</name>
              <description>PDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDE_0</name>
                  <description>Power Down Counter of WDOG is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDE_1</name>
                  <description>Power Down Counter of WDOG is enabled (Default).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
