nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
        <register>
          <name>CCGR0</name>
          <description>CCM Clock Gating Register 0</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG0</name>
              <description>aips_tz1 clocks (aips_tz1_clk_enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG1</name>
              <description>aips_tz2 clocks (aips_tz2_clk_enable)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG2</name>
              <description>mqs clock ( mqs_hmclk_clock_enable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG3</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG4</name>
              <description>sim_m or sim_main register access clock (sim_m_mainclk_r_enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG5</name>
              <description>dcp clock (dcp_clk_enable)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG6</name>
              <description>lpuart3 clock (lpuart3_clk_enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG7</name>
              <description>can1 clock (can1_clk_enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG8</name>
              <description>can1_serial clock (can1_serial_clk_enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG9</name>
              <description>can2 clock (can2_clk_enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG10</name>
              <description>can2_serial clock (can2_serial_clk_enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG11</name>
              <description>trace clock (trace_clk_enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG12</name>
              <description>gpt2 bus clocks (gpt2_bus_clk_enable)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG13</name>
              <description>gpt2 serial clocks (gpt2_serial_clk_enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG14</name>
              <description>lpuart2 clock (lpuart2_clk_enable)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG15</name>
              <description>gpio2_clocks (gpio2_clk_enable)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCGR1</name>
          <description>CCM Clock Gating Register 1</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG0</name>
              <description>lpspi1 clocks (lpspi1_clk_enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG1</name>
              <description>lpspi2 clocks (lpspi2_clk_enable)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG2</name>
              <description>lpspi3 clocks (lpspi3_clk_enable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG3</name>
              <description>lpspi4 clocks (lpspi4_clk_enable)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG4</name>
              <description>adc2 clock (adc2_clk_enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG5</name>
              <description>enet clock (enet_clk_enable)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG6</name>
              <description>pit clocks (pit_clk_enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG7</name>
              <description>aoi2 clocks (aoi2_clk_enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG8</name>
              <description>adc1 clock (adc1_clk_enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG9</name>
              <description>semc_exsc clock (semc_exsc_clk_enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG10</name>
              <description>gpt1 bus clock (gpt_clk_enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG11</name>
              <description>gpt1 serial clock (gpt_serial_clk_enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG12</name>
              <description>lpuart4 clock (lpuart4_clk_enable)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG13</name>
              <description>gpio1 clock (gpio1_clk_enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG14</name>
              <description>csu clock (csu_clk_enable)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG15</name>
              <description>gpio5 clock (gpio5_clk_enable)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCGR2</name>
          <description>CCM Clock Gating Register 2</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFC3FFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG0</name>
              <description>ocram_exsc clock (ocram_exsc_clk_enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG1</name>
              <description>csi clock (csi_clk_enable)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG2</name>
              <description>iomuxc_snvs clock (iomuxc_snvs_clk_enable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG3</name>
              <description>lpi2c1 clock (lpi2c1_clk_enable)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG4</name>
              <description>lpi2c2 clock (lpi2c2_clk_enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG5</name>
              <description>lpi2c3 clock (lpi2c3_clk_enable)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG6</name>
              <description>OCOTP_CTRL clock (ocotp_clk_enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG7</name>
              <description>xbar3 clock (xbar3_clk_enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG8</name>
              <description>ipmux1 clock (ipmux1_clk_enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG9</name>
              <description>ipmux2 clock (ipmux2_clk_enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG10</name>
              <description>ipmux3 clock (ipmux3_clk_enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG11</name>
              <description>xbar1 clock (xbar1_clk_enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG12</name>
              <description>xbar2 clock (xbar2_clk_enable)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG13</name>
              <description>gpio3 clock (gpio3_clk_enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG14</name>
              <description>lcd clocks (lcd_clk_enable)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG15</name>
              <description>pxp clocks (pxp_clk_enable)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCGR3</name>
          <description>CCM Clock Gating Register 3</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFCF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG0</name>
              <description>flexio2 clocks (flexio2_clk_enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG1</name>
              <description>lpuart5 clock (lpuart5_clk_enable)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG2</name>
              <description>semc clocks (semc_clk_enable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG3</name>
              <description>lpuart6 clock (lpuart6_clk_enable)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG4</name>
              <description>aoi1 clock (aoi1_clk_enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG5</name>
              <description>lcdif pix clock (lcdif_pix_clk_enable)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG6</name>
              <description>gpio4 clock (gpio4_clk_enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG7</name>
              <description>ewm clocks (ewm_clk_enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG8</name>
              <description>wdog1 clock (wdog1_clk_enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG9</name>
              <description>flexram clock (flexram_clk_enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG10</name>
              <description>acmp1 clocks (acmp1_clk_enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG11</name>
              <description>acmp2 clocks (acmp2_clk_enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG12</name>
              <description>acmp3 clocks (acmp3_clk_enable)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG13</name>
              <description>acmp4 clocks (acmp4_clk_enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG14</name>
              <description>The OCRAM clock cannot be turned off when the CM cache is running on this device.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG15</name>
              <description>iomuxc_snvs_gpr clock (iomuxc_snvs_gpr_clk_enable)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCGR4</name>
          <description>CCM Clock Gating Register 4</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG0</name>
              <description>sim_m7 register access clock (sim_m7_mainclk_r_enable)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG1</name>
              <description>iomuxc clock (iomuxc_clk_enable)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG2</name>
              <description>iomuxc gpr clock (iomuxc_gpr_clk_enable)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG3</name>
              <description>bee clock(bee_clk_enable)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG4</name>
              <description>sim_m7 clock (sim_m7_clk_enable)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG5</name>
              <description>tsc_dig clock (tsc_clk_enable)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG6</name>
              <description>sim_m clocks (sim_m_clk_enable)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG7</name>
              <description>sim_ems clocks (sim_ems_clk_enable)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG8</name>
              <description>pwm1 clocks (pwm1_clk_enable)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG9</name>
              <description>pwm2 clocks (pwm2_clk_enable)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG10</name>
              <description>pwm3 clocks (pwm3_clk_enable)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG11</name>
              <description>pwm4 clocks (pwm4_clk_enable)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG12</name>
              <description>qdc1 clocks (qdc1_clk_enable)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG13</name>
              <description>qdc2 clocks (qdc2_clk_enable)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG14</name>
              <description>qdc3 clocks (qdc3_clk_enable)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CG15</name>
              <description>qdc4 clocks (qdc4_clk_enable)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
