nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="TMR1">
      <name>TMR2</name>
      <description>TMR</description>
      <groupName>TMR</groupName>
      <baseAddress>0x401E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7A</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR2</name>
        <value>134</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TMR1">
      <name>TMR3</name>
      <description>TMR</description>
      <groupName>TMR</groupName>
      <baseAddress>0x401E4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7A</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR3</name>
        <value>135</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TMR1">
      <name>TMR4</name>
      <description>TMR</description>
      <groupName>TMR</groupName>
      <baseAddress>0x401E8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7A</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR4</name>
        <value>136</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPT1</name>
      <description>GPT</description>
      <groupName>GPT</groupName>
      <headerStructName>GPT</headerStructName>
      <baseAddress>0x401EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPT1</name>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>GPT Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>GPT Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENMOD</name>
              <description>GPT Enable Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESUME_COUNT</name>
                  <description>Restart counting from their frozen values after GPT is enabled (EN=1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_COUNT</name>
                  <description>Reset counting from 0 after GPT is enabled (EN=1).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGEN</name>
              <description>GPT Debug Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUG_DIS</name>
                  <description>Disable in Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG_EN</name>
                  <description>Enable in Debug mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>GPT Wait Mode Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAIT_DIS</name>
                  <description>Disable in Wait mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_EN</name>
                  <description>Enable in Wait mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEEN</name>
              <description>GPT Doze Mode Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZE_DIS</name>
                  <description>Disable in Doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZE_EN</name>
                  <description>Enable in Doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN</name>
              <description>GPT Stop Mode Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_DIS</name>
                  <description>Disable in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_EN</name>
                  <description>Enable in Stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>Clock Source Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_001</name>
                  <description>Peripheral Clock (ipg_clk)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_010</name>
                  <description>High Frequency Reference Clock (ipg_clk_highfreq)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_011</name>
                  <description>External Clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_100</name>
                  <description>Low Frequency Reference Clock (ipg_clk_32k)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_101</name>
                  <description>Oscillator as Reference Clock (ipg_clk_24M)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRR</name>
              <description>Free-Run or Restart Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Restart mode. After a compare event, the counter resets to 0x0000_0000 and resumes counting.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE_RUN</name>
                  <description>Free-Run mode. After a compare event, the counter continues counting until 0xFFFF_FFFF and then rolls over to 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_24M</name>
              <description>Enable Oscillator Clock Input</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SWRESET</name>
                  <description>GPT is not in software reset state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWRESET</name>
                  <description>GPT is in software reset state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM1</name>
              <description>Input Capture Operating Mode for Channel 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Capture disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Capture on rising edge only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Capture on falling edge only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Capture on both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM2</name>
              <description>Input Capture Operating Mode for Channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Capture disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Capture on rising edge only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Capture on falling edge only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Capture on both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OM1</name>
              <description>Output Compare Operating Mode for Channel 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Output disabled. No response on pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Toggle output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear output pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set output pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>Generate a low pulse that is one input clock cycle wide on the output pin. When OMn is first programmed as 1xx, the output pin is set to one immediately on the next input clock (if it was not one already). &quot;Input clock&quot; here refers to the clock selected by the CLKSRC field of this register.</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OM2</name>
              <description>Output Compare Operating Mode for Channel 2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Output disabled. No response on pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Toggle output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear output pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set output pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>Generate a low pulse that is one input clock cycle wide on the output pin. When OMn is first programmed as 1xx, the output pin is set to one immediately on the next input clock (if it was not one already). &quot;Input clock&quot; here refers to the clock selected by the CLKSRC field of this register.</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OM3</name>
              <description>Output Compare Operating Mode for Channel 3</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Output disabled. No response on pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Toggle output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear output pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set output pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>Generate a low pulse that is one input clock cycle wide on the output pin. When OMn is first programmed as 1xx, the output pin is set to one immediately on the next input clock (if it was not one already). &quot;Input clock&quot; here refers to the clock selected by the CLKSRC field of this register.</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FO1</name>
              <description>Force Output Compare for Channel 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FORCE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>Trigger the programmed response on the pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FO2</name>
              <description>Force Output Compare for Channel 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FORCE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>Trigger the programmed response on the pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FO3</name>
              <description>Force Output Compare for Channel 3</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FORCE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>Trigger the programmed response on the pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>GPT Prescaler Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler divide value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4096</name>
                  <description>Divide by 4096</description>
                  <value>0xFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALER24M</name>
              <description>Prescaler divide value for the oscillator clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16</name>
                  <description>Divide by 16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
