nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
        <register>
          <name>ENET2_IPP_IND_MAC0_RXEN_SELECT_INPUT</name>
          <description>ENET2_IPP_IND_MAC0_RXEN_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_37_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_37 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_05_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B0_05 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_03_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_03 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET2_IPP_IND_MAC0_RXERR_SELECT_INPUT</name>
          <description>ENET2_IPP_IND_MAC0_RXERR_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_34_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_34 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_02_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B0_02 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_00_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_00 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET2_IPP_IND_MAC0_TIMER_SELECT_INPUT_0</name>
          <description>ENET2_IPP_IND_MAC0_TIMER_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_01_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_B1_01 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_03_ALT8</name>
                  <description>Selecting Pad: GPIO_B0_03 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET2_IPP_IND_MAC0_TXCLK_SELECT_INPUT</name>
          <description>ENET2_IPP_IND_MAC0_TXCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_33_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_33 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_01_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B0_01 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_15_ALT8</name>
                  <description>Selecting Pad: GPIO_B0_15 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_DQS_FA_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_DQS_FA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_00_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_00 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_09_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_09 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FA_BIT0_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FA_BIT0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_04_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_04 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_26_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_26 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_02_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_02 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FA_BIT1_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FA_BIT1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_03_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_03 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_27_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_27 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_12_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_12 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FA_BIT2_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FA_BIT2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_02_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_02 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_28_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_28 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_06_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_06 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FA_BIT3_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FA_BIT3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_01_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_01 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_29_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_29 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_10_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_10 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT0_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_13_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_13 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_11_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_11 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT1_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_14_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_14 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_07_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_07 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT2_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_15_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_15 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_03_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_03 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_IO_FB_BIT3_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_IO_FB_BIT3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x74C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_16_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_16 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_04_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_04 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_SCK_FA_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_SCK_FA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SPI_B1_05_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B1_05 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_08_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_08 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_IPP_IND_SCK_FB_SELECT_INPUT</name>
          <description>FLEXSPI2_IPP_IND_SCK_FB_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x754</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_12_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_12 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SPI_B0_01_ALT0</name>
                  <description>Selecting Pad: GPIO_SPI_B0_01 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT1_IPP_IND_CAPIN1_SELECT_INPUT</name>
          <description>GPT1_IPP_IND_CAPIN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x758</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_24_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_24 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_05_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_05 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT1_IPP_IND_CAPIN2_SELECT_INPUT</name>
          <description>GPT1_IPP_IND_CAPIN2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x75C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_06_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_06 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
