nxp-mcuxpresso/mcux-soc-svd/MIMXRT1061/MIMXRT1061.xml
        <register>
          <name>MMFAR</name>
          <description>MemManage Fault Address Register</description>
          <addressOffset>0xD34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address of MemManage fault location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BFAR</name>
          <description>BusFault Address Register</description>
          <addressOffset>0xD38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address of the BusFault location</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR0</name>
          <description>Processor Feature Register 0</description>
          <addressOffset>0xD40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATE0</name>
              <description>ARM instruction set support</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATE0_0</name>
                  <description>ARMv7-M unused</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE0_1</name>
                  <description>ARMv7-M unused</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE0_2</name>
                  <description>ARMv7-M unused</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE0_3</name>
                  <description>Support for Thumb encoding including Thumb-2 technology, with all basic 16-bit and 32-bit instructions.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE1</name>
              <description>Thumb instruction set support</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATE1_0</name>
                  <description>The processor does not support the ARM instruction set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE1_1</name>
                  <description>ARMv7-M unused</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE2</name>
              <description>ARMv7-M unused</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE3</name>
              <description>ARMv7-M unused</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR1</name>
          <description>Processor Feature Register 1</description>
          <addressOffset>0xD44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PROGMODEL</name>
              <description>M profile programmers' model</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGMODEL_0</name>
                  <description>ARMv7-M unused</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROGMODEL_2</name>
                  <description>Two-stack programmers' model supported</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_DFR0</name>
          <description>Debug Feature Register</description>
          <addressOffset>0xD48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEBUGMODEL</name>
              <description>Support for memory-mapped debug model for M profile processors</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUGMODEL_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUGMODEL_1</name>
                  <description>Support for M profile Debug architecture, with memory-mapped access.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_AFR0</name>
          <description>Auxiliary Feature Register</description>
          <addressOffset>0xD4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMPLEMENTATION_DEFINED0</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTATION_DEFINED1</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTATION_DEFINED2</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTATION_DEFINED3</name>
              <description>Gives information about the IMPLEMENTATION DEFINED features of a processor implementation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR0</name>
          <description>Memory Model Feature Register 0</description>
          <addressOffset>0xD50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMSASUPPORT</name>
              <description>Indicates support for a PMSA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMSASUPPORT_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMSASUPPORT_1</name>
                  <description>ARMv7-M unused</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMSASUPPORT_2</name>
                  <description>ARMv7-M unused</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMSASUPPORT_3</name>
                  <description>PMSAv7, providing support for a base region and subregions.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTERMOST_SHAREABILITY</name>
              <description>Indicates the outermost shareability domain implemented</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_0</name>
                  <description>Implemented as Non-cacheable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_1</name>
                  <description>ARMv7-M unused</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_2</name>
                  <description>ARMv7-M unused</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_3</name>
                  <description>ARMv7-M unused</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_4</name>
                  <description>ARMv7-M unused</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_5</name>
                  <description>ARMv7-M unused</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_6</name>
                  <description>ARMv7-M unused</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_7</name>
                  <description>ARMv7-M unused</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_8</name>
                  <description>ARMv7-M unused</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_9</name>
                  <description>ARMv7-M unused</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_10</name>
                  <description>ARMv7-M unused</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_11</name>
                  <description>ARMv7-M unused</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_12</name>
                  <description>ARMv7-M unused</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_13</name>
                  <description>ARMv7-M unused</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_14</name>
                  <description>ARMv7-M unused</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTERMOST_SHAREABILITY_15</name>
                  <description>Shareability ignored.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREABILITY_LEVELS</name>
              <description>Indicates the number of shareability levels implemented</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAREABILITY_LEVELS_0</name>
                  <description>One level of shareability implemented</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAREABILITY_LEVELS_1</name>
                  <description>ARMv7-M unused</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_SUPPORT</name>
              <description>Indicates the support for Tightly Coupled Memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_SUPPORT_0</name>
                  <description>No tightly coupled memories implemented.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_SUPPORT_1</name>
                  <description>Tightly coupled memories implemented with IMPLEMENTATION DEFINED control.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_SUPPORT_2</name>
                  <description>ARMv7-M unused</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXILIARY_REGISTERS</name>
              <description>Indicates the support for Auxiliary registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUXILIARY_REGISTERS_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXILIARY_REGISTERS_1</name>
                  <description>Support for Auxiliary Control Register only.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXILIARY_REGISTERS_2</name>
                  <description>ARMv7-M unused</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <description>Memory Model Feature Register 1</description>
          <addressOffset>0xD54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_MMFR1</name>
              <description>Gives information about the implemented memory model and memory management support.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <description>Memory Model Feature Register 2</description>
          <addressOffset>0xD58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WFI_STALL</name>
              <description>Indicates the support for Wait For Interrupt (WFI) stalling</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WFI_STALL_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WFI_STALL_1</name>
                  <description>Support for WFI stalling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <description>Memory Model Feature Register 3</description>
          <addressOffset>0xD5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID_MMFR3</name>
              <description>Gives information about the implemented memory model and memory management support.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
